def isValidSudoku(board):
    '''
    1. 逐行、逐列、逐区域检查，每遍历到不是.的数字时，在check中查找该数的出现次数值
    2. 如果次数=0，就将check中该值+1
    3. 如果>0，就返回False
    4. 如果三次遍历完，则返回True
    '''
    
    for i in range(0, 9):
        check = {str(i): 0 for i in range(1, 10)}
        for j in range(0, 9):
            num = board[i][j] # 行
            if num != '.':
                if check[num] > 0:
                    return False
                check[num] = 1

    for i in range(0, 9):
        check = {str(i): 0 for i in range(1, 10)}
        for j in range(0, 9):
            num = board[j][i] # 列
            if num != '.':
                if check[num] > 0:
                    return False
                check[num] = 1
    for x in range(0,3):
        for y in range(0,3):
            check = {str(i): 0 for i in range(1, 10)}
            for i in range(3*x + 0, 3*x + 3):
                for j in range(3*y + 0, 3*y + 3):
                    num = board[i][j] # 行
                    if num != '.':
                        if check[num] > 0:
                            return False
                        check[num] = 1
    return True



board = [
        [".",".",".",".","5",".",".","1","."],
        [".","4",".","3",".",".",".",".","."],
        [".",".",".",".",".","3",".",".","1"],
        ["8",".",".",".",".",".",".","2","."],
        [".",".","2",".","7",".",".",".","."],
        [".","1","5",".",".",".",".",".","."],
        [".",".",".",".",".","2",".",".","."],
        [".","2",".","9",".",".",".",".","."],
        [".",".","4",".",".",".",".",".","."]
        ]
board2 = [
        ["5","3",".",".","7",".",".",".","."],
        ["6",".",".","1","9","5",".",".","."],
        [".","9","8",".",".",".",".","6","."],
        ["8",".",".",".","6",".",".",".","3"],
        ["4",".",".","8",".","3",".",".","1"],
        ["7",".",".",".","2",".",".",".","6"],
        [".","6",".",".",".",".","2","8","."],
        [".",".",".","4","1","9",".",".","5"],
        [".",".",".",".","8",".",".","7","9"]
        ]
print(isValidSudoku(board))